{
  "id": 13, 
  "title": "Cross-Site Request Forgery", 
  "severity": "high", 
  "description": [
    "In the majority of today's web applications, clients are required to", 
    "submit forms which can perform sensitive operations.\n\nAn example of", 
    "such a form being used would be when an administrator wishes to create", 
    "a new user for the application.\n\nIn the simplest version of the form,", 
    "the administrator would fill-in:\n\n* Name * Password * Role (level of", 
    "access)\n\nContinuing with this example, Cross Site Request Forgery", 
    "(CSRF) would occur when the administrator is tricked into clicking on", 
    "a link, which if logged into the application, would automatically", 
    "submit the form without any further interaction.\n\nCyber-criminals will", 
    "look for sites where sensitive functions are performed in this manner", 
    "and then craft malicious requests that will be used against clients", 
    "via a social engineering attack.\n\nThere are 3 things that are required", 
    "for a CSRF attack to occur:\n\n1. The form must perform some sort of", 
    "sensitive action. 2. The victim (the administrator the example above)", 
    "must have an active session. 3. Most importantly, all parameter values", 
    "must be **known** or **guessable**.\n\nThe tool discovered that all", 
    "parameters within the form were known or predictable and therefore the", 
    "form could be vulnerable to CSRF.\n\n_Manual verification may be", 
    "required to check whether the submission will then perform a sensitive", 
    "action, such as reset a password, modify user profiles, post content", 
    "on a forum, etc._"
  ], 
  "fix": {
    "effort": 50, 
    "guidance": [
      "Based on the risk (determined by manual verification) of whether the", 
      "form submission performs a sensitive action, the addition of anti-CSRF", 
      "tokens may be required.\n\nThese tokens can be configured in such a way", 
      "that each session generates a new anti-CSRF token or such that each", 
      "individual request requires a new token.\n\nIt is important that the", 
      "server track and maintain the status of each token (in order to reject", 
      "requests accompanied by invalid ones) and therefore prevent", 
      "cyber-criminals from knowing, guessing or reusing them.\n\n_For examples", 
      "of framework specific remediation options, please refer to the", 
      "references._"
    ]
  }, 
  "cwe": ["352"],
  "owasp_top_10": {"2013": [8]},
  "tags": [
    "web",
    "csrf", 
    "form", 
    "token"
  ], 
  "references": [
    {
      "url": "http://www.cgisecurity.com/csrf-faq.html", 
      "title": "CGI Security - CSRF"
    }, 
    {
      "url": "http://en.wikipedia.org/wiki/Cross-site_request_forgery", 
      "title": "Wikipedia - CSRF"
    }, 
    {
      "url": "https://www.owasp.org/index.php/Cross-Site_Request_Forgery_(CSRF)", 
      "title": "OWASP - CSRF"
    }
  ]
}