{
  "id": 3, 
  "title": "Backup directory", 
  "severity": "medium", 
  "description": [
    "A common practice when administering web applications is to create a", 
    "copy/backup of a particular directory prior to making any", 
    "modification. Another common practice is to add an extension or change", 
    "the name of the original directory to signify that it is a backup", 
    "(examples include `.bak`, `.orig`, `.backup`, etc.).\n\nDuring the", 
    "initial recon stages of an attack, cyber-criminals will attempt to", 
    "locate backup directories by adding common extensions onto directories", 
    "already discovered on the webserver. By analysing the response headers", 
    "from the server they are able to determine if a backup directory", 
    "exists. These backup directories can then assist in the compromise of", 
    "the web application.\n\nBy utilising the same method, the tool was able", 
    "to discover a possible backup directory."
  ], 
  "fix": {
    "effort": 50, 
    "guidance": [
      "Do not keep obsolete versions of directories under the virtual web", 
      "server root.\n\nWhen updating the site, delete or move the directories", 
      "to a directory outside the virtual root, edit them there, and move (or", 
      "copy) the directories back to the virtual root. Make sure that only", 
      "the directories that are actually in use reside under the virtual", 
      "root.\n\nPreventing access without authentication may also be an option", 
      "and stop a client being able to view the contents of a directory,", 
      "however it is still likely that the filenames will be able to be", 
      "discovered.\n\nUsing obscure filenames is only implementing security", 
      "through obscurity and is not a recommended option."
    ]
  }, 
  "tags": [
    "web",
    "path", 
    "backup", 
    "file", 
    "discovery"
  ], 
  "references": [
    {
      "url": "http://www.webappsec.org/projects/threat/classes/information_leakage.shtml", 
      "title": "WebAppSec"
    }
  ]
}