{
  "id": 31, 
  "title": "Exposed localstart.asp page", 
  "severity": "low", 
  "description": [
    "To restrict access to specific pages on a webserver, developers can", 
    "implement\nvarious methods of authentication, therefore only allowing", 
    "access to clients\nwith valid credentials.\nThere are several forms of", 
    "authentication that can be used. The simplest forms of\nauthentication", 
    "are known as 'Basic' and 'Basic Realm'.\nThese methods of", 
    "authentication have several known weaknesses such as being\nsusceptible", 
    "to brute force attacks.\n\nAdditionally, when utilising the NTLM", 
    "mechanism in a windows environment, several\ndisclosures of information", 
    "exist, and any brute force attack occurs against the\nserver's local", 
    "users, or domain users if the web server is a domain member.", 
    "Cyber-criminals will attempt to locate protected pages to gain access", 
    "to them\nand also perform brute force attacks to discover valid", 
    "credentials.\n\nThe tool discovered the following page requires NTLM", 
    "based basic authentication\nin order to be accessed."
  ], 
  "fix": {
    "effort": 50, 
    "guidance": [
      "If the pages being protected are not required for the functionality of", 
      "the web\napplication they should be removed, otherwise, it is", 
      "recommended that basic\nand basic realm authentication are not used to", 
      "protect against pages requiring\nauthentication.\n\nIf NTLM based basic", 
      "authentication must be used, then default server and domain\naccounts", 
      "such as `administrator` and `root` should be disabled, as these will", 
      "undoubtedly be the first accounts to be targeted in any such attack.", 
      "Additionally, the webserver should not be joined to any corporate", 
      "domain where\nusernames are readily available (such as from email", 
      "addresses). If the pages are\nrequired, and it is possible to remove", 
      "the basic authentication, then a stronger\nand more resilient", 
      "form-based authentication mechanism should be implemented to\nprotect", 
      "the affected pages."
    ]
  }, 
  "tags": [
    "asp", 
    "iis", 
    "server"
  ]
}