{
    "name": "Blind SQL Injection (differential analysis)", 
    "tags": [
        "sql", 
        "blind", 
        "differential", 
        "injection", 
        "database"
    ], 
    "description": "\nDue to the requirement for dynamic content of today's web applications, many\nrely on a database backend to store data that will be called upon and processed\nby the web application (or other programs).\nWeb applications retrieve data from the database by using Structured Query Language\n(SQL) queries.\n\nTo meet demands of many developers, database servers (such as MSSQL, MySQL,\nOracle etc.) have additional built-in functionality that can allow extensive\ncontrol of the database and interaction with the host operating system itself.\n\nAn SQL injection occurs when a value originating from the client's request is used\nwithin a SQL query without prior sanitisation. This could allow cyber-criminals\nto execute arbitrary SQL code and steal data or use the additional functionality\nof the database server to take control of more server components.\n\nThe successful exploitation of a SQL injection can be devastating to an\norganisation and is one of the most commonly exploited web application vulnerabilities.\n\nThis injection was detected as The tool was able to inject specific SQL queries,\nthat if vulnerable, result in the responses for each injection being different.\nThis is known as a blind SQL injection vulnerability.\n", 
    "references": {
        "MITRE - CAPEC": "http://capec.mitre.org/data/definitions/7.html", 
        "WASC": "http://projects.webappsec.org/w/page/13246963/SQL%20Injection", 
        "W3 Schools": "http://www.w3schools.com/sql/sql_injection.asp", 
        "OWASP": "https://www.owasp.org/index.php/Blind_SQL_Injection"
    }, 
    "cwe": 89, 
    "remedy_guidance": "\nThe only proven method to prevent against SQL injection attacks while still\nmaintaining full application functionality is to use parameterized queries\n(also known as prepared statements).\nWhen utilising this method of querying the database, any value supplied by the\nclient will be handled as a string value rather than part of the SQL query.\n\nAdditionally, when utilising parameterized queries, the database engine will\nautomatically check to make sure the string being used matches that of the column.\nFor example, the database engine will check that the user supplied input is an\ninteger if the database column is configured to contain integers.\n", 
    "severity": "high"
}